Revit 2026 API

# ElementGetDependentElements Method

---

Get all elements that, from a logical point of view, are the children of this Element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetDependentElements(
	ElementFilter filter
)
```
```vb
Public Function GetDependentElements (
	filter As ElementFilter
) As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetDependentElements(
	ElementFilter^ filter
)
```
```fsharp
member GetDependentElements :
        filter : ElementFilter -> IList<ElementId>
```

#### Parameters

filter ElementFilter
     What type of elements we are interested of. Can be NULL to return all dependent elements.

#### Return Value

IListElementId Logical children of this element

The elements that this method will return:

  1. Will be deleted if the input Element is deleted.
  2. Potentially could report the input Element as a host (there could be other type of parent/child relationship here: for example view/view-specific elements, etc.)

#### Reference

Element Class

Autodesk.Revit.DB Namespace